// 도, 광역시 기준 Viewport 설정
const districtViewport = {
  대한민국: { lat: 36.38, lng: 127.51, zoom: 7 },
  서울특별시: { lat: 37.540705, lng: 126.956764, zoom: 10.5 },
  인천광역시: { lat: 37.469221, lng: 126.573234, zoom: 9 },
  광주광역시: { lat: 35.126033, lng: 126.831302, zoom: 10 },
  대구광역시: { lat: 35.798838, lng: 128.583052, zoom: 10 },
  울산광역시: { lat: 35.519301, lng: 129.239078, zoom: 10 },
  대전광역시: { lat: 36.321655, lng: 127.378953, zoom: 10 },
  부산광역시: { lat: 35.198362, lng: 129.053922, zoom: 10 },
  세종특별자치시: { lat: 36.5575, lng: 127.264, zoom: 10 },
  경기도: { lat: 37.567167, lng: 127.190292, zoom: 8 },
  강원도: { lat: 37.555837, lng: 128.209315, zoom: 8 },
  충청남도: { lat: 36.557229, lng: 126.779757, zoom: 8 },
  충청북도: { lat: 36.628503, lng: 127.929344, zoom: 8 },
  경상북도: { lat: 36.248647, lng: 128.664734, zoom: 8 },
  경상남도: { lat: 35.259787, lng: 127.803922, zoom: 8 },
  전라북도: { lat: 35.716705, lng: 127.144185, zoom: 8 },
  전라남도: { lat: 34.8194, lng: 127.003113, zoom: 8 },
  제주특별자치도: { lat: 33.364805, lng: 126.542671, zoom: 8 },
};

export default districtViewport;
